<?xml version="1.0" ?>
<net name="saved_model" version="10">
	<layers>
		<layer id="0" name="image_input" type="Parameter" version="opset1">
			<data shape="1,3,608,608" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>608</dim>
					<dim>608</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="StatefulPartitionedCall/model/conv2d/Conv2D/Transpose26629_const" type="Const" version="opset1">
			<data offset="0" size="3456" shape="32,3,3,3" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="StatefulPartitionedCall/model/conv2d/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>608</dim>
					<dim>608</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>608</dim>
					<dim>608</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_2105822030/EltwiseUnsqueeze22262_const" type="Const" version="opset1">
			<data offset="3456" size="128" shape="1,32,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>608</dim>
					<dim>608</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>608</dim>
					<dim>608</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/model/activation/mul" type="Mish" version="opset4">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>608</dim>
					<dim>608</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>608</dim>
					<dim>608</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/model/conv2d_1/Conv2D/Transpose26633_const" type="Const" version="opset1">
			<data offset="3584" size="73728" shape="64,32,3,3" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/model/conv2d_1/Conv2D" type="Convolution" version="opset1">
			<data strides="2,2" dilations="1,1" pads_begin="1,1" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>608</dim>
					<dim>608</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="data_add_210612106622032/EltwiseUnsqueeze22270_const" type="Const" version="opset1">
			<data offset="77312" size="256" shape="1,64,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/model/activation_1/mul" type="Mish" version="opset4">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/model/conv2d_3/Conv2D/Transpose26637_const" type="Const" version="opset1">
			<data offset="77568" size="16384" shape="64,64,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/model/conv2d_3/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="data_add_210772108222036/EltwiseUnsqueeze22286_const" type="Const" version="opset1">
			<data offset="93952" size="256" shape="1,64,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/model/batch_normalization_3/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/model/activation_3/mul" type="Mish" version="opset4">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/model/conv2d_4/Conv2D/Transpose26641_const" type="Const" version="opset1">
			<data offset="94208" size="8192" shape="32,64,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/model/conv2d_4/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="data_add_210852109022038/EltwiseUnsqueeze22294_const" type="Const" version="opset1">
			<data offset="102400" size="128" shape="1,32,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/model/batch_normalization_4/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/model/activation_4/mul" type="Mish" version="opset4">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/model/conv2d_5/Conv2D/Transpose26645_const" type="Const" version="opset1">
			<data offset="102528" size="73728" shape="64,32,3,3" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/model/conv2d_5/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="data_add_210932109822040/EltwiseUnsqueeze22302_const" type="Const" version="opset1">
			<data offset="176256" size="256" shape="1,64,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/model/batch_normalization_5/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/model/activation_5/mul" type="Mish" version="opset4">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/model/add/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/model/conv2d_6/Conv2D/Transpose26649_const" type="Const" version="opset1">
			<data offset="176512" size="16384" shape="64,64,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/model/conv2d_6/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="data_add_211012110622042/EltwiseUnsqueeze22310_const" type="Const" version="opset1">
			<data offset="192896" size="256" shape="1,64,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/model/batch_normalization_6/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/model/activation_6/mul" type="Mish" version="opset4">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/model/conv2d_2/Conv2D/Transpose26653_const" type="Const" version="opset1">
			<data offset="193152" size="16384" shape="64,64,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/model/conv2d_2/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="data_add_210692107422034/EltwiseUnsqueeze22278_const" type="Const" version="opset1">
			<data offset="209536" size="256" shape="1,64,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/model/batch_normalization_2/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/model/activation_2/mul" type="Mish" version="opset4">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/model/concatenate/concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="StatefulPartitionedCall/model/conv2d_7/Conv2D/Transpose26657_const" type="Const" version="opset1">
			<data offset="209792" size="32768" shape="64,128,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/model/conv2d_7/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="data_add_211092111422044/EltwiseUnsqueeze22318_const" type="Const" version="opset1">
			<data offset="242560" size="256" shape="1,64,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/model/batch_normalization_7/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/model/activation_7/mul" type="Mish" version="opset4">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="StatefulPartitionedCall/model/conv2d_8/Conv2D/Transpose26661_const" type="Const" version="opset1">
			<data offset="242816" size="294912" shape="128,64,3,3" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/model/conv2d_8/Conv2D" type="Convolution" version="opset1">
			<data strides="2,2" dilations="1,1" pads_begin="1,1" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="data_add_211172112222046/EltwiseUnsqueeze22326_const" type="Const" version="opset1">
			<data offset="537728" size="512" shape="1,128,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="StatefulPartitionedCall/model/batch_normalization_8/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/model/activation_8/mul" type="Mish" version="opset4">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/model/conv2d_10/Conv2D/Transpose26665_const" type="Const" version="opset1">
			<data offset="538240" size="32768" shape="64,128,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/model/conv2d_10/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="data_add_211332113822050/EltwiseUnsqueeze22342_const" type="Const" version="opset1">
			<data offset="571008" size="256" shape="1,64,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/model/batch_normalization_10/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/model/activation_10/mul" type="Mish" version="opset4">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/model/conv2d_11/Conv2D/Transpose26669_const" type="Const" version="opset1">
			<data offset="571264" size="16384" shape="64,64,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/model/conv2d_11/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="data_add_211412114622052/EltwiseUnsqueeze22350_const" type="Const" version="opset1">
			<data offset="587648" size="256" shape="1,64,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/model/batch_normalization_11/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/model/activation_11/mul" type="Mish" version="opset4">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/model/conv2d_12/Conv2D/Transpose26673_const" type="Const" version="opset1">
			<data offset="587904" size="147456" shape="64,64,3,3" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="StatefulPartitionedCall/model/conv2d_12/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="data_add_211492115422054/EltwiseUnsqueeze22358_const" type="Const" version="opset1">
			<data offset="735360" size="256" shape="1,64,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="StatefulPartitionedCall/model/batch_normalization_12/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/model/activation_12/mul" type="Mish" version="opset4">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/model/add_1/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/model/conv2d_13/Conv2D/Transpose26677_const" type="Const" version="opset1">
			<data offset="735616" size="16384" shape="64,64,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="StatefulPartitionedCall/model/conv2d_13/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="data_add_211572116222056/EltwiseUnsqueeze22366_const" type="Const" version="opset1">
			<data offset="752000" size="256" shape="1,64,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="StatefulPartitionedCall/model/batch_normalization_13/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="StatefulPartitionedCall/model/activation_13/mul" type="Mish" version="opset4">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="StatefulPartitionedCall/model/conv2d_14/Conv2D/Transpose26681_const" type="Const" version="opset1">
			<data offset="752256" size="147456" shape="64,64,3,3" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/model/conv2d_14/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="data_add_211652117022058/EltwiseUnsqueeze22374_const" type="Const" version="opset1">
			<data offset="899712" size="256" shape="1,64,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="StatefulPartitionedCall/model/batch_normalization_14/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="StatefulPartitionedCall/model/activation_14/mul" type="Mish" version="opset4">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="StatefulPartitionedCall/model/add_2/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="StatefulPartitionedCall/model/conv2d_15/Conv2D/Transpose26685_const" type="Const" version="opset1">
			<data offset="899968" size="16384" shape="64,64,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="StatefulPartitionedCall/model/conv2d_15/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="data_add_211732117822060/EltwiseUnsqueeze22382_const" type="Const" version="opset1">
			<data offset="916352" size="256" shape="1,64,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="StatefulPartitionedCall/model/batch_normalization_15/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="StatefulPartitionedCall/model/activation_15/mul" type="Mish" version="opset4">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="StatefulPartitionedCall/model/conv2d_9/Conv2D/Transpose26689_const" type="Const" version="opset1">
			<data offset="916608" size="32768" shape="64,128,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="StatefulPartitionedCall/model/conv2d_9/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="data_add_211252113022048/EltwiseUnsqueeze22334_const" type="Const" version="opset1">
			<data offset="949376" size="256" shape="1,64,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="StatefulPartitionedCall/model/batch_normalization_9/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="StatefulPartitionedCall/model/activation_9/mul" type="Mish" version="opset4">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="StatefulPartitionedCall/model/concatenate_1/concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="StatefulPartitionedCall/model/conv2d_16/Conv2D/Transpose26693_const" type="Const" version="opset1">
			<data offset="949632" size="65536" shape="128,128,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="StatefulPartitionedCall/model/conv2d_16/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="data_add_211812118622062/EltwiseUnsqueeze22390_const" type="Const" version="opset1">
			<data offset="1015168" size="512" shape="1,128,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="StatefulPartitionedCall/model/batch_normalization_16/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="StatefulPartitionedCall/model/activation_16/mul" type="Mish" version="opset4">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="StatefulPartitionedCall/model/conv2d_17/Conv2D/Transpose26697_const" type="Const" version="opset1">
			<data offset="1015680" size="1179648" shape="256,128,3,3" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="StatefulPartitionedCall/model/conv2d_17/Conv2D" type="Convolution" version="opset1">
			<data strides="2,2" dilations="1,1" pads_begin="1,1" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="data_add_211892119422064/EltwiseUnsqueeze22398_const" type="Const" version="opset1">
			<data offset="2195328" size="1024" shape="1,256,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="StatefulPartitionedCall/model/batch_normalization_17/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="StatefulPartitionedCall/model/activation_17/mul" type="Mish" version="opset4">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="StatefulPartitionedCall/model/conv2d_19/Conv2D/Transpose26701_const" type="Const" version="opset1">
			<data offset="2196352" size="131072" shape="128,256,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="StatefulPartitionedCall/model/conv2d_19/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="data_add_212052121022068/EltwiseUnsqueeze22414_const" type="Const" version="opset1">
			<data offset="2327424" size="512" shape="1,128,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="StatefulPartitionedCall/model/batch_normalization_19/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="StatefulPartitionedCall/model/activation_19/mul" type="Mish" version="opset4">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="StatefulPartitionedCall/model/conv2d_20/Conv2D/Transpose26705_const" type="Const" version="opset1">
			<data offset="2327936" size="65536" shape="128,128,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="StatefulPartitionedCall/model/conv2d_20/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="data_add_212132121822070/EltwiseUnsqueeze22422_const" type="Const" version="opset1">
			<data offset="2393472" size="512" shape="1,128,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="StatefulPartitionedCall/model/batch_normalization_20/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="StatefulPartitionedCall/model/activation_20/mul" type="Mish" version="opset4">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="StatefulPartitionedCall/model/conv2d_21/Conv2D/Transpose26709_const" type="Const" version="opset1">
			<data offset="2393984" size="589824" shape="128,128,3,3" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="StatefulPartitionedCall/model/conv2d_21/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="data_add_212212122622072/EltwiseUnsqueeze22430_const" type="Const" version="opset1">
			<data offset="2983808" size="512" shape="1,128,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="StatefulPartitionedCall/model/batch_normalization_21/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="StatefulPartitionedCall/model/activation_21/mul" type="Mish" version="opset4">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="StatefulPartitionedCall/model/add_3/add" type="Add" version="opset1">
			<input>
				<port id="0">
